{
  "sidebarMenu": [
    "Department Profile",
    "Organisation Structure",
    "Head of Department",
    "Faculty & Staff",
    "Academic Programs",
    "PEO & PO-PSO",
    "Course Outcomes (CO)",
    "Facilities",
    "Student Achievement",
    "Research & Product Development",
    "Publications",
    "Events",
    "Gallery"
  ],
  "mainContent": {
    "vision": "To be recognized as a center of knowledge dissemination in Computer Science and Engineering by imparting value-added education to transform budding minds into competent computer professionals.",
    "mission": [
      "Provide a value-based learning environment enriched with ethics, honesty and integrity that equips students to cater to the needs of society and industry.",
      "Augment the knowledge of students towards cutting-edge technologies and state-of-the-art tools of Computer Science & Engineering.",
      "Create opportunities for all-round development of students through co-curricular and extra-curricular activities.",
      "Promote research, innovation and development activities in the field of Computer Science among staff and students without any bias."
    ],
    "departmentProfile": "The department was started in the year 2001 to offer under graduate degree programme in Bachelor of Engineering (BE) in Computer Science & Engineering (CSE). The department also offered post graduate programme in engineering i.e. M.Tech in Computer Science Engineering (CSE) from 2010 to 2021. The department has dedicated, qualified and experienced faculty members to guide the students in academics. The faculty members are actively involved in teaching, product development and research. The faculty members have published number of research and review papers/articles in referred international journals and reputed International Conferences which are archived at IEEE/ACM/Springer and other renowned digital libraries.\n\nThe department frequently organizes training programmes for the faculty, technical staff and students. The faculty frequently attends staff development programmes (SDP/FDP/Seminars) to update themselves in technological advancements and conferences to present research findings. The department is also involved in the students’ career by placing special emphasis on all-round development through continuous interaction with industry. Interactive sessions with experts from academia, research laboratories and industry are constantly held so as to enable students to gain knowledge on emerging trends. The campus placement has been scaling higher and higher pass right from its inception with multinational companies recruiting students in large numbers. To enhance the opportunity of placements to students, the department conducts soft skills training programmes, technical skill development activities and initiatives on self-learning (Spoken Tutorial programmes by IIT Bombay).\n\nThe department promotes extra-curricular activities under the umbrella of the students’ association & SPECS. The department brings out Annual technical magazine and newsletter which provides an opportunity for the students and staff to publish innovative ideas, programming skills and articles on current trends in computing and technology. The student’s association and National Service Scheme (NSS) wing frequently conducts various programmes to strengthen leadership skills, teamwork and communication, and awareness on protection of environment and societal responsibilities."
  }
}
